Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/kata/httpd/target_count_13/repeat_33/10.txt
2020/01/26 06:32:52 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8010/
2020/01/26 06:33:22 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 46183 requests
Server Software:        Apache/2.4.41
Server Hostname:        192.168.3.100
Server Port:            8010
Document Path:          /
Document Length:        45 bytes
Concurrency Level:      100
Time taken for tests:   30.003 seconds
Complete requests:      46183
Failed requests:        0
Total transferred:      13350933 bytes
HTML transferred:       2078865 bytes
Requests per second:    1539.26 [#/sec] (mean)
Time per request:       64.966 [ms] (mean)
Time per request:       0.650 [ms] (mean, across all concurrent requests)
Transfer rate:          434.55 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   12  66.1      3    1042
Processing:     0   53 151.4     12    1704
Waiting:        0   19  31.1      9     579
Total:          1   65 167.9     18    1709
Percentage of the requests served within a certain time (ms)
  50%     18
  66%     30
  75%     39
  80%     49
  90%     90
  95%    472
  98%    684
  99%    814
 100%   1709 (longest request)
2020/01/26 06:33:22 Matched stat line [Connect:        0   12  66.1      3    1042 Connect 0 12 66.1 3 1042]
2020/01/26 06:33:22 Matched stat line [Processing:     0   53 151.4     12    1704 Processing 0 53 151.4 12 1704]
2020/01/26 06:33:22 Matched stat line [Waiting:        0   19  31.1      9     579 Waiting 0 19 31.1 9 579]
2020/01/26 06:33:22 Matched stat line [Total:          1   65 167.9     18    1709 Total 1 65 167.9 18 1709]
2020/01/26 06:33:22 Matched percentline [  50%     18 50 18]
2020/01/26 06:33:22 Matched percentline [  66%     30 66 30]
2020/01/26 06:33:22 Matched percentline [  75%     39 75 39]
2020/01/26 06:33:22 Matched percentline [  80%     49 80 49]
2020/01/26 06:33:22 Matched percentline [  90%     90 90 90]
2020/01/26 06:33:22 Matched percentline [  95%    472 95 472]
2020/01/26 06:33:22 Matched percentline [  98%    684 98 684]
2020/01/26 06:33:22 Matched percentline [  99%    814 99 814]
2020/01/26 06:33:22 Matched percentline [ 100%   1709 100 1709]
{"connect":{"max":1042,"mean":12,"median":3,"min":0,"stdDev":66.0999984741211},"percentiles":{"100":1709,"50":18,"66":30,"75":39,"80":49,"90":90,"95":472,"98":684,"99":814},"processing":{"max":1704,"mean":53,"median":12,"min":0,"stdDev":151.39999389648438},"total":{"max":1709,"mean":65,"median":18,"min":1,"stdDev":167.89999389648438},"waiting":{"max":579,"mean":19,"median":9,"min":0,"stdDev":31.100000381469727}}